In [4]:
import pandas as pd
df = pd.read_csv("C:\\Users\\SARAVANA PROCESS\\Downloads\\day3_students.csv")
df

  Name,Dept,StudyHours,SleepHours,TotalHours
0                             A,AI&DS,5,7,12
1                                B,DS,6,6,12
2                             C,AI&DS,4,8,12
3                             D,AI&DS,6,5,11
4                             E,AI&DS,7,7,14

In [6]:
df.head(3)

  Name,Dept,StudyHours,SleepHours,TotalHours
0                             A,AI&DS,5,7,12
1                                B,DS,6,6,12
2                             C,AI&DS,4,8,12

In [7]:
df.tail(3)

  Name,Dept,StudyHours,SleepHours,TotalHours
2                             C,AI&DS,4,8,12
3                             D,AI&DS,6,5,11
4                             E,AI&DS,7,7,14

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   Name,Dept,StudyHours,SleepHours,TotalHours  5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [9]:
df.isnull().sum()

Name,Dept,StudyHours,SleepHours,TotalHours    0
dtype: int64

In [10]:
df.describe()

       Name,Dept,StudyHours,SleepHours,TotalHours
count                                           5
unique                                          5
top                                A,AI&DS,5,7,12
freq                                            1

In [16]:
import pandas as pd

# Create DataFrame
data = {
    "Name": ["Dhanya", "Adhira", "Karthik", "Meena", "Ravi", 
             "Priya", "Arun", "Sneha", "Vikram", "Divya"],
    "Department": ["AI&DS", "CSE", "ECE", "AI&DS", "CSE", 
                   "EEE", "ECE", "AI&DS", "CSE", "EEE"],
    "StudyHours": [5, 7, 4, 6, 8, 3, 9, 2, 7, 6],
    "Marks": [78, 85, 60, 92, 70, 45, 88, 40, 95, 72]
}

df = pd.DataFrame(data)

# Show DataFrame
print(df)

      Name Department  StudyHours  Marks
0   Dhanya      AI&DS           5     78
1   Adhira        CSE           7     85
2  Karthik        ECE           4     60
3    Meena      AI&DS           6     92
4     Ravi        CSE           8     70
5    Priya        EEE           3     45
6     Arun        ECE           9     88
7    Sneha      AI&DS           2     40
8   Vikram        CSE           7     95
9    Divya        EEE           6     72

In [13]:
df.head(5)

      Name Department  StudyHours  Marks
0   Dhanya      AI&DS           5     78
1   Adhira        CSE           7     85
2  Karthik        ECE           4     60
3    Meena      AI&DS           6     92
4     Ravi        CSE           8     70

In [17]:
print(df.columns)

Index(['Name', 'Department', 'StudyHours', 'Marks'], dtype='object')

In [19]:
print(df.shape)

(10, 4)

In [21]:
print(df[df["StudyHours"]>6])

     Name Department  StudyHours  Marks
1  Adhira        CSE           7     85
4    Ravi        CSE           8     70
6    Arun        ECE           9     88
8  Vikram        CSE           7     95

In [22]:
print(df[df["Department"]=="AI&DS"])

     Name Department  StudyHours  Marks
0  Dhanya      AI&DS           5     78
3   Meena      AI&DS           6     92
7   Sneha      AI&DS           2     40

In [23]:
print(df.sort_values(by = "Marks",ascending =False))

      Name Department  StudyHours  Marks
8   Vikram        CSE           7     95
3    Meena      AI&DS           6     92
6     Arun        ECE           9     88
1   Adhira        CSE           7     85
0   Dhanya      AI&DS           5     78
9    Divya        EEE           6     72
4     Ravi        CSE           8     70
2  Karthik        ECE           4     60
5    Priya        EEE           3     45
7    Sneha      AI&DS           2     40

In [25]:
print(df.groupby("Department")["Marks"].mean())

Department
AI&DS    70.000000
CSE      83.333333
ECE      74.000000
EEE      58.500000
Name: Marks, dtype: float64

In [26]:
df["Result"]=df["Marks"].apply(lambda x:"Pass" if x>=50 else "Fail")
print(df)

      Name Department  StudyHours  Marks Result
0   Dhanya      AI&DS           5     78   Pass
1   Adhira        CSE           7     85   Pass
2  Karthik        ECE           4     60   Pass
3    Meena      AI&DS           6     92   Pass
4     Ravi        CSE           8     70   Pass
5    Priya        EEE           3     45   Fail
6     Arun        ECE           9     88   Pass
7    Sneha      AI&DS           2     40   Fail
8   Vikram        CSE           7     95   Pass
9    Divya        EEE           6     72   Pass

In [30]:
print(df["Marks"].mean())
print(df["Marks"].median())
print(df["Marks"].min())
print(df["Marks"].max())

72.5
75.0
40
95